{
  "category": "bewitchment:rituals",
  "name": "Досягнення Буття Ліча",
  "icon": "besmirchment:lich_gem",
  "entry_color": "C15600",
  "advancement": "bewitchment:hidden_unlocks/demon_heart",
  "flag": "bsm_lichdom",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "Ура! Нарешті, безсмертя:$(br2)Цей $(l:bewitchment:rituals/rituals)Ритуал$() дозволяє заклинателю або найближчому до нього гравцю досягти вищого стану смертності (або безсмертя?)$(br)Цей стан називається буття ліча.$(br)Він визначається прив'язкою тіла до зовнішньої Філактерії, що надає більший запас душ. Ліч без неї практично безсилий."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "besmirchment:phylactery",
      "text": "Кількість душ у Філактерії пропорційна силі ліча, як зазначено у $(l:besmirchment:rituals/lichdom#quirks)Особливостях Буття Ліча$().$(br)Наповнюється за допомогою Самоцвіту Ліча."
    },
    {
      "type": "patchouli:spotlight",
      "item": "besmirchment:lich_gem",
      "text": "Самоцвіт Лікаря створюється разом з Філактерією. $(br)Вам потрібно буде тримати його в руці, вбиваючи чисту істоту, зазвичай селянина.$(br)Щоб заповнити філактерію, використовуйте її на філактерію."
    },
    {
      "type": "bewitchment:ritual",
      "recipe": "besmirchment:rituals/reach_lichdom",
      "text": "Початок цього Ритуалу вимагає відсутності душі, або, коротко кажучи, наявності $(l:bewitchment:curses/apathy) Апатії$() Прокляття.$(br)Він також вимагатиме жертвоприношення демонічної істоти."
    },
    {
      "type": "patchouli:text",
      "anchor": "quirks",
      "title": "Особливості Буття Ліча",
      "text": "Лічдом має кілька помітних особливостей.$(br)По-перше, личинки не можуть померти, доки їхні філактерії залишаються цілими. Убиті, вони відроджуються на місці з повним здоров'ям і поглинають душу з філактерії.$(br)При цьому, тільки одна філактерія може стояти одночасно (і спроба розмістити нову призведе до того, що попередня буде розбита, і вони не можуть померти)."
    },
    {
      "type": "patchouli:text",
      "text": "Лишайники з дуже малою кількістю душ у філактерії зазвичай дуже слабкі, але їхня сила зростає, чим більше душ вони збирають.$(br)При достатній кількості душ вони можуть навіть набувати примарної форми! Ця форма вимагає багато МЕ, але здатна проникати крізь блоки. Вона також може бути пофарбована за допомогою $(l:besmirchment:tools/witchy_dye)Відьомський барвник. Щоб прийняти форму привида, натисніть [$(k:bewitchment.transformation_ability)]."
    },
    {
      "type": "patchouli:text",
      "text": "Нарешті, лишайники вважаються неживими, багато хто може втекти від них. Це також означає, що вони слабкі до $(l:bewitchment:intro/silver)Срібла$(). Вбиті ним, вони будуть негайно відправлені назад до своєї Філактерії, виснаживши дві душі, і НЕ будуть відроджені.$(br2)$(o)Коли лічі швидко відроджуються, вони також можуть добровільно повертатися до свого філактерію, крадучись.$(br2)Буття Ліча вважається перетворенням, тому лічі не можуть стати вампірами, перевертнями і т.д.$()"
    }
  ]
}
