{
"tipsmod.title.default": "Порада",
"tipsmod.tip.no_tips": "Підказки не завантажено. Будь ласка, перегляньте конфігурації.",
"tipsmod.tip.undead_damage": "Скелети і зомбі отримують ушкодження від зілля здоров'я і зцілюються зіллям пошкоджень.",
"tipsmod.tip.poison_immune": "Зомбі, скелети та павуки мають імунітет до пошкоджень від отрути.",
"tipsmod.tip.witch_conversion": "Селянини стають відьмами, коли їх вражає блискавка.",
"tipsmod.tip.four_eggs": "У дуже рідкісних випадках з курячих яєць можуть вилупитися чотири курчата.",
"tipsmod.tip.nether_lava": "Лава поширюватиметься швидше у підземеллі.",
"tipsmod.tip.east": "Сонце, Місяць і зірки рухаються на схід.",
"tipsmod.tip.swamp_slime": "Слизняки можуть розмножуватися в болотах під час повного місяця.",
"tipsmod.tip.deflect_ghast_fireballs": "Ви можете відбивати вогняні кулі нечисті, атакуючи їх.",
"tipsmod.tip.shulker_armor": "Шалкери отримують значно більше шкоди, коли їхні панцирі відкриті.",
"tipsmod.tip.arthropods": "Павуки, сріблясті рибки, бджоли та ендерміти отримують шкоду від Прокляття членистоногих.",
"tipsmod.tip.fossils": "Великі скам'янілості поховані під болотами та пустелями.",
"tipsmod.tip.crouch_blocks": "Уміння крастися/присідати запобігає падінню з блоків.",
"tipsmod.tip.smoke_bees": "Розміщення багаття під бджолиним гніздом зробить бджіл пасивними.",
"tipsmod.tip.lava_fuel": "Відра з лавою можна використовувати як паливо для печі.",
"tipsmod.tip.wooden_tool_fuel": "Старі дерев'яні інструменти можна використовувати як паливо для печі.",
"tipsmod.tip.scrap_nuggets": "Золоті та залізні інструменти/обладунки можна перетопили на самородки.",
"tipsmod.tip.piglin_gold": "Піґліни дуже люблять золото.",
"tipsmod.tip.dog_health": "Чим нижче хвіст собаки, тим менше у неї залишилося здоров'я.",
"tipsmod.tip.dog_rotten_flesh": "Ви можете вилікувати своїх собак, нагодувавши їх гнилою плоттю.",
"tipsmod.tip.lure_animals": "Ви можете заманити тварин за собою, тримаючи в руках їжу, яку вони люблять.",
"tipsmod.tip.cooked_drops": "Тварини, що загинули від пожежі, зазвичай дропають смажене м'ясо.",
"tipsmod.tip.nether_sponge": "Мокрі губки одразу ж висохнуть, якщо їх покласти у відсік.",
"tipsmod.tip.boat_passenger": "Човни можуть перевозити двох пасажирів.",
"tipsmod.tip.shulker_golem": "Шалкери вважаються різновидом ґолема.",
"tipsmod.tip.note_block_instrument": "Інструмент блоку нотаток визначається блоком, що знаходиться під ним.",
"tipsmod.tip.zombie_armor": "Зомбі мають два базових очки броні, навіть якщо вони не мають броні.",
"tipsmod.tip.undead_helmet": "Моби нежиті не згоряють при денному світлі, якщо на них є шолом.",
"tipsmod.tip.iron_golem_heal": "Залізних ґолемів можна вилікувати, давши їм злитки заліза.",
"tipsmod.tip.turtle_shell": "Черепахи скидають панцир лише тоді, коли дитинча виростає у дорослу особину.",
"tipsmod.tip.animal_growing": "Годуючи дитинчат, ви прискорите їхнє дорослішання.",
"tipsmod.tip.blaze_snowball": "Блискавки отримують пошкодження від снігових кульок.",
"tipsmod.tip.biome_bonemeal": "Використання кісткового борошна на блоках трави може дати різні види квітів.",
"tipsmod.tip.biome_fishing": "Риболовля в джунглях може дати вам різні предмети порівняно з риболовлею в інших біомах.",
"tipsmod.tip.fishing_resources": "Риболовля - чудовий спосіб отримати зачаровані книги високого рівня.",
"tipsmod.tip.boat_jump": "Помістивши човен у лаву, ви можете зробити тимчасову платформу.",
"tipsmod.tip.creeper_cat": "Кріпери бояться котів і тікатимуть від них.",
"tipsmod.tip.water_grass": "Вода може швидко зламати траву і дістати насіння.",
"tipsmod.tip.gravity_torch": "Падаючі блоки, такі як пісок і гравій, миттєво розбиваються при падінні на смолоскип.",
"tipsmod.tip.string_wool": "Нитку можна скласти 2 на 2, щоб зробити вовну.",
"tipsmod.tip.barrel": "Діжки - зручна альтернатива скриням.",
"tipsmod.tip.job_site_dimension": "При зміні розмірів селяни втрачають робоче місце.",
"tipsmod.tip.villager_sweat": "Селяни пітніють, коли з ними намагаються торгувати під час набігу.",
"tipsmod.tip.wandering_invis": "Бродячі торговці вночі п'ють зілля невидимості.",
"tipsmod.tip.baby_panda_slimeball": "Дитинчата панд мають 0,1% шанс виплюнути слизьку кульку після того, як вони чхнуть.",
"tipsmod.tip.fortress_triangulation": "Ви можете тріангулювати розташування фортеці, викликавши очі ендерів з двох різних місць і відстеживши, де вони перетинаються.",
"tipsmod.tip.creeper_drops_disc": "Якщо стріла Скелета або Примари вб'є кріпера, він скине випадковий музичний диск.",
"tipsmod.tip.mooshroom_lightning": "Червоний мухомор стане коричневим мухомором, а коричневий мухомор стане червоним, якщо в нього влучить блискавка.",
"tipsmod.tip.bed_explode": "Спроба заснути в інших вимірах закінчиться погано.",
"tipsmod.tip.fall_damage_blocks": "Деякі блоки, такі як вода і сіно, можуть зменшити шкоду від падіння.",
"tipsmod.tip.bed_respawn": "Сон у ліжку встановлює точку відродження.",
"tipsmod.tip.ore_tiers": "Деякі руди мають мінімально необхідний рівень кайла, щоб їх можна було видобути.",
"tipsmod.tip.sponge_bucket": "Мокру губку можна висушити в печі, зваривши її. Якщо в паливному слоті стоїть порожнє відро, воно буде ловити воду!",
"tipsmod.tip.coarse_to_dirt": "Грубий бруд можна перетворити на звичайний за допомогою мотики.",
"tipsmod.tip.enderman_blocks": "Ендермен може переміщати такі блоки, як бруд, пісок і тротил!",
"tipsmod.tip.dragon_blocks": "Залізні прути, кінцевий камінь і обсидіан мають імунітет до пошкоджень від дракона Ендера.",
"tipsmod.tip.piglin_repellent": "Пігліни бояться вогняних блоків душі, включаючи смолоскип душ і ліхтар душ.",
"tipsmod.tip.portal_trick": "Використовуючи відра з водою та лавою, ви можете зробити простий нижній портал.",
"tipsmod.tip.blaze_fuel": "Вогняні стрижні - гарне паливо для печей.",
"tipsmod.tip.goat_milk": "Козу можна доїти за допомогою відра.",
"tipsmod.tip.mean_goats": "Будьте обережні з козами, вони люблять зіштовхувати гравців та інших тварин зі скель.",
"tipsmod.tip.dripstone_lava": "Загострений камінь під лавою буде повільно капати частинками лави. Це можна використовувати для наповнення казана.",
"tipsmod.tip.bucket_friends": "Рибу та аксолотлів можна безпечно збирати за допомогою відер.",
"tipsmod.tip.bucket_rename": "Перейменування відра з мобом всередині перейменує і цього моба.",
"tipsmod.tip.axolotl_food": "Аксолотлі люблять їсти тропічну рибу.",
"tipsmod.tip.wax_copper": "Бджолині стільники можна використовувати для воскування мідних блоків. Це запобігає їхньому окисленню.",
"tipsmod.tip.freezing_leather": "Шкіряні обладунки можуть захистити від пошкоджень при замерзанні.",
"tipsmod.tip.azalea_caves": "Дерева азалії ростуть над зарослими печерними біомами.",
"gui.tips.list.title": "Список порад",
"gui.tips.list.search": "Пошук",
"gui.tips.list.show_disabled": "Показати відключеним",
"gui.tips.list.entry.tip_id": "Ідентифікатор підказки: %s",
"gui.tips.list.entry.added_by": "Додав: %s: %s",
"gui.tips.list.entry.cycle_time": "Час циклу: %s",
"gui.tips.list.entry.copied": "Скопійовано!",
"gui.tips.list.entry.click_to_copy": "Натисніть, щоб скопіювати ID",
"gui.tips.list.entry.disabled": "Вимкнено за допомогою конфігурації!",
"gui.tips.list.config": "Конфігурація"
}