{
    "option.ebe.config": "Блокові сутності...",

    "value.ebe.true": "Увімкнено",
    "value.ebe.false": "Вимкнено",
    "value.ebe.allowed": "Дозволено",
    "value.ebe.forced": "Примусово",
    "value.ebe.disabled": "Вимкнено",
    "value.ebe.smart": "Розумний",
    "value.ebe.all": "Усе",
    "value.ebe.most": "Більшість",
    "value.ebe.some": "Кілька",
    "value.ebe.few": "Трохи",

    "option.ebe.render_enhanced_chests": "Покращити скрині",
    "option.ebe.render_enhanced_chests.comment": "Enables baked chest models, greatly improving performance in areas with lots of chests. Also allows for seeing chests from far distances. Disable if chests appear invisible due to another mod.",
    "option.ebe.render_enhanced_signs": "Покращити таблички",
    "option.ebe.render_enhanced_signs.comment": "Enables baked sign models and smart sign text rendering, greatly improving performance in areas with lots of signs. Also allows for seeing signs from far distances. Disable if signs appear invisible due to another mod.",
    "option.ebe.render_enhanced_bells": "Покращити дзвони",
    "option.ebe.render_enhanced_bells.comment": "Enables fully baked bell models, greatly improving performance in areas with lots of bells. Also allows for seeing bells from far distances. Disable if bells appear invisible due to another mod.",
    "option.ebe.render_enhanced_beds": "Покращити Beds",
    "option.ebe.render_enhanced_beds.comment": "Enables baked bed models, greatly improving performance in areas with lots of beds. Also allows for seeing beds from far distances. Disable if beds appear invisible due to another mod.",
    "option.ebe.render_enhanced_shulker_boxes": "Покращити шалкерові коробки",
    "option.ebe.render_enhanced_shulker_boxes.comment": "Enables baked shulker box models, greatly improving performance in areas with lots of shulker boxes. Also allows for seeing shulker boxes from far distances. Disable if shulker boxes appear invisible due to another mod.",
    "option.ebe.render_enhanced_decorated_pots": "Покращити декоративні горщики",
    "option.ebe.render_enhanced_decorated_pots.comment": "Enables baked decorated pot models, greatly improving performance in areas with lots of decorated pots. Also allows for seeing decorated pots from far distances. Disable if decorated pots appear invisible, or if modded pottery patterns are not working properly.",
    "option.ebe.chest_ao": "Гладке освітлення скринь",
    "option.ebe.chest_ao.comment": "Дозволяє скриням використовувати плавне освітлення та оклюзію навколишнього середовища. Потрібно, щоб були ввімкнені вдосконалені скрині.",
    "option.ebe.sign_ao": "Гладке освітлення табличок",
    "option.ebe.sign_ao.comment": "Дозволяє табличкам використовувати плавне освітлення та оклюзію навколишнього середовища. Потрібно, щоб були ввімкнені вдосконалені таблички.",
    "option.ebe.bell_ao": "Гладке освітлення дзвонів",
    "option.ebe.bell_ao.comment": "Дозволяє дзвонам використовувати плавне освітлення та оклюзію навколишнього середовища. Потрібно, щоб були ввімкнені вдосконалені дзвони.",
    "option.ebe.bed_ao": "Гладке освітлення ліжок",
    "option.ebe.bed_ao.comment": "Дозволяє ліжкам використовувати плавне освітлення та оклюзію навколишнього середовища. Потрібно, щоб були ввімкнені вдосконалені ліжка.",
    "option.ebe.shulker_box_ao": "Гладке освітлення шалкерових коробок",
    "option.ebe.shulker_box_ao.comment": "Дозволяє шалкеровим коробкам використовувати плавне освітлення та оклюзію навколишнього середовища. Потрібно, щоб були ввімкнені вдосконалені шалкерові коробки.",
    "option.ebe.decorated_pot_ao": "Гладке освітлення декоративного горщика",
    "option.ebe.decorated_pot_ao.comment": "Allows for decorated pots to use smooth lighting and ambient occlusion. Requires Enhanced Decorated Pots to be enabled.",
    "option.ebe.christmas_chests": "Різдвяні скрині",
    "option.ebe.christmas_chests.valueComment.allowed": "Дозволено - Різдвяна текстура буде відображатися з 24 по 26 грудня.",
    "option.ebe.christmas_chests.valueComment.forced": "Примусово - Різдвяна текстура буде відображатися завжди.",
    "option.ebe.christmas_chests.valueComment.disabled": "Вимкнено - Різдвяна текстура не буде відображатися.",
    "option.ebe.christmas_chests.comment": "Either allows, forces, or disables the Christmas chest texture. Requires Enhanced Chests to be enabled.",
    "option.ebe.sign_text_rendering": "Відображення тексту табличок",
    "option.ebe.sign_text_rendering.valueComment.smart": "Розумний - максимальна відстань відображення буде автоматично визначатися на основі того, скільки табличок відображається одночасно.",
    "option.ebe.sign_text_rendering.valueComment.all": "Усі - Усі таблички, що знаходяться у межах дальності відображення блокових сутностей, намагатимуться відобразити текст. Сильний вплив на продуктивність.",
    "option.ebe.sign_text_rendering.valueComment.most": "Більшість - Усі таблички, що знаходяться на половині відстані відображення блокових сутностей, намагатимуться відобразити текст.",
    "option.ebe.sign_text_rendering.valueComment.some": "Деякі - Усі таблички, що знаходяться на 30%% від відстані відображення блокових сутностей, намагатимуться відобразити текст. ",
    "option.ebe.sign_text_rendering.valueComment.few": "Трохи - Усі таблички, що знаходяться на 20%% від відстані відображення блокових сутностей, намагатимуться відобразити текст. Найбільш продуктивно.",
    "option.ebe.sign_text_rendering.comment": "Determines the maximum distance from the player that sign text will render. Requires Enhanced Signs to be enabled.",
    "option.ebe.experimental_chests": "Експериментальне відображення скринь",
    "option.ebe.experimental_chests.comment": "Enables very experimental rendering features for chests, such as specially generated particle textures which work with resource packs.",
    "option.ebe.experimental_beds": "Експериментальне відображення ліжок",
    "option.ebe.experimental_beds.comment": "Enables very experimental rendering features for beds, such as specially generated particle textures which work with resource packs.",
    "option.ebe.experimental_signs": "Експериментальне відображення таблчиок",
    "option.ebe.experimental_signs.comment": "Enables very experimental rendering features for signs, such as specially generated particle textures which work with resource packs.",
    "option.ebe.force_resource_pack_compat": "Примусова сумісність із ресурспаками",
    "option.ebe.force_resource_pack_compat.comment": "Enable this if blocks are invisible when using resource packs. Do not use with resource packs designed for this mod. If issues continue, report them.",
    "option.ebe.dump": "Вивантажити шаблонні ресурси",
    "option.ebe.dump.comment": "Скидає стандартні ресурси мода у .minecraft/enhanced_bes_dump/ для використання у якості шаблона для творців ресурспаків.",

    "screen.ebe.config": "Налаштування блокових сутностей",

    "text.ebe.apply": "Застосувати",
    "text.ebe.descriptions": "Наведіть мишу для відображення описів",
    "text.ebe.chest_options": "Налаштування скринь",
    "text.ebe.sign_options": "Налаштування табличок",
    "text.ebe.bell_options": "Налаштування дзвонів",
    "text.ebe.bed_options": "Налаштування ліжок",
    "text.ebe.shulker_box_options": "Налаштування шалкерових коробок",
    "text.ebe.decorated_pot_options": "Налаштування декоративних горщиків",
    "text.ebe.advanced": "Просунуті",
    "text.ebe.option_value_division": ": "
}