{
  "jeed.category.effect_info": "Ефекти",
  "jeed.tooltip.color_complete": "%1$s: %2$s",
  "jeed.tooltip.color": "Колір",
  "jeed.tooltip.beneficial": "Корисний",
  "jeed.tooltip.neutral": "Нейтральний",
  "jeed.tooltip.harmful": "Шкідливий",
  "jeed.description.missing": "Опис відсутній",

  "effect.minecraft.absorption.description": "Додає кілька сердець, що поглинають шкоду (і не можуть бути відновлені); вищі рівні дають більше поглинання.",
  "effect.minecraft.bad_omen.description": "Викликає зловісну подію при вході в село або підземелля випробувань; вищі рівні збільшують складність події.",
  "effect.minecraft.blindness.description": "Погіршує зір і вимикає можливість бігати та завдавати критичних ударів.",
  "effect.minecraft.conduit_power.description": "Збільшує видимість під водою та швидкість видобутку, запобігає утопленню.",
  "effect.minecraft.darkness.description": "Додає пульсівний ефект затемнення екрана гравця та пульсівний чорний туман.",
  "effect.minecraft.trial_omen.description": "Перетворює найближчі породжувачі випробувань на зловісні породжувачі випробувань. Триває 15 хвилин, повторюючи рівні оригінального ефекту «Погана прикмета».",
  "effect.minecraft.raid_omen.description": "Починає рейд у місці, де було отримано ефект, після закінчення дії ефекту. Триває 30 секунд.",
  "effect.minecraft.dolphins_grace.description": "Значно збільшує швидкість плавання. Ефект надається дельфінами.",
  "effect.minecraft.wind_charged.description": "Змушує уражені сутності випускати порив вітру при смерті.",
  "effect.minecraft.weaving.description": "Змушує уражені сутності поширювати блоки павутини при смерті.",
  "effect.minecraft.oozing.description": "Змушує уражені сутності породжувати два слизи при смерті.",
  "effect.minecraft.infested.description": "Надає ураженим сутностям 10% шанс породити від 1 до 2 лусківниць при пораненні.",
  "effect.minecraft.fire_resistance.description": "Надає імунітет до ураження вогнем або лавою.",
  "effect.minecraft.glowing.description": "Позначає уражені сутності контурним світінням, що дозволяє бачити їх крізь блоки.",
  "effect.minecraft.haste.description": "Збільшує швидкість видобутку та атаки; вищі рівні збільшують обидва показники ще більше.",
  "effect.minecraft.health_boost.description": "Збільшує максимальне здоров'я; вищі рівні дають більше додаткових сердець.",
  "effect.minecraft.hero_of_the_village.description": "Дає знижки на торгівлю з селянами та змушує селян кидати предмети в гравця залежно від їхньої професії.",
  "effect.minecraft.hunger.description": "Збільшує виснаження їжі; вищі рівні призводять до швидшого зголодніння.",
  "effect.minecraft.instant_damage.description": "Завдає шкоди живим істотам, лікує неживих; вищі рівні збільшують силу ефекту.",
  "effect.minecraft.instant_health.description": "Зцілює живі істоти, завдає шкоди неживим істотам; вищі рівні збільшують силу ефекту.",
  "effect.minecraft.invisibility.description": "Надає невидимість, роблячи користувача невидимим і зменшуючи діапазон його виявлення. Предмети в руках чи на тілі все одно будуть видимими. Вищі рівні ще більше зменшують діапазон виявлення.",
  "effect.minecraft.jump_boost.description": "Збільшує висоту стрибка і зменшує шкоду від падіння; вищі рівні збільшують обидва ефекти.",
  "effect.minecraft.levitation.description": "Змушує уражені істоти здійматися вгору.",
  "effect.minecraft.luck.description": "Може збільшити шанси на отримання високоякісного і більшого луту; вищі рівні збільшують шанси на отримання кращого луту.",
  "effect.minecraft.mining_fatigue.description": "Зменшує швидкість видобутку та атаки; вищі рівні ще більше зменшують обидва показники.",
  "effect.minecraft.nausea.description": "Коливає і спотворює екран.",
  "effect.minecraft.night_vision.description": "Покращує зір у темних місцях і під водою.",
  "effect.minecraft.poison.description": "Завдає нелетальної шкоди з часом; вищі рівні завдають більше шкоди за секунду. Не впливає на неживих.",
  "effect.minecraft.regeneration.description": "Відновлює здоров'я з часом; вищі рівні прискорюють відновлення здоров'я.",
  "effect.minecraft.resistance.description": "Забезпечує 20% зменшення шкоди за рівень.",
  "effect.minecraft.saturation.description": "Відновлює голод і ситість.",
  "effect.minecraft.slow_falling.description": "Зменшує швидкість падіння і нівелює шкоду від падіння.",
  "effect.minecraft.slowness.description": "Зменшує швидкість ходьби; вищі рівні роблять користувача повільнішим і зменшують його поле зору.",
  "effect.minecraft.speed.description": "Збільшує швидкість ходьби; вищі рівні роблять користувача швидшим і збільшують його поле зору.",
  "effect.minecraft.strength.description": "Збільшує шкоду в ближньому бою; вищі рівні збільшують силу підвищення шкоди.",
  "effect.minecraft.unluck.description": "Може зменшити шанси на високоякісний і більший лут; вищі рівні зменшують шанс на хороший лут.",
  "effect.minecraft.water_breathing.description": "Запобігає утопленню і дозволяє дихати під водою.",
  "effect.minecraft.weakness.description": "Зменшує шкоду в ближньому бою; вищі рівні зменшують завдану шкоду ще більше.",
  "effect.minecraft.wither.description": "Завдає смертельної шкоди з часом; вищі рівні завдають більше шкоди за секунду.",

  "effect.abundance.succumbing.description": "Отруює користувача на короткий час, коли він отримує будь-яку шкоду.",
  "effect.abundance.supportive.description": "Надає регенерацію тваринам, силу нейтральним мобам і стійкість монстрам.",

  "effect.alexsmobs.bug_pheromones.description": "Зробить ворожих членистоногих нейтральними до користувача.",
  "effect.alexsmobs.clinging.description": "Дозволяє ходити догори ногами по стелі.",
  "effect.alexsmobs.debilitating_sting.description": "Ефект, який отруює жертву, але паралізує членистоногих. Він припиняється, якщо жертва має половину здоров'я і не є членистоногим. Завдається тарантулом-яструбом.",
  "effect.alexsmobs.ender_flu.description": "Після природного закінчення ефекту користувач отримує величезну шкоду і з'являється ендеріофаг. Завдається ендеріофагом.",
  "effect.alexsmobs.exsanguination.description": "Поступово виснажує здоров'я.",
  "effect.alexsmobs.fear.description": "Змушує ціль не рухатися. Ефект застосовується, коли тигр показує себе користувачеві.",
  "effect.alexsmobs.knockback_resistance.description": "Надає 50% стійкості до відкидання.",
  "effect.alexsmobs.lava_vision.description": "Дозволяє бачити крізь лаву.",
  "effect.alexsmobs.oiled.description": "Масло плаває на воді. Покрийте себе маслом, щоб плавати на поверхні води та зовні під дощем.",
  "effect.alexsmobs.orcas_might.description": "Надає підвищену швидкість атаки. Ефект може застосовуватися під час плавання з косаткою.",
  "effect.alexsmobs.poison_resistance.description": "Надає імунітет до отрути.",
  "effect.alexsmobs.soulsteal.description": "Надає користувачеві деякий крадіж життя.",
  "effect.alexsmobs.sunbird_blessing.description": "Зменшує швидкість падіння, запобігає пошкодженню від падіння і полегшує політ з елітрами або елітрами тарантула-яструба. Ефект застосовується, коли ви знаходитесь поблизу сонячної пташки.",
  "effect.alexsmobs.sunbird_curse.description": "Збільшує швидкість падіння, змушуючи користувача швидше впасти на землю. Це ефективно перешкоджає використанню елітр. Ефект застосовується, коли ви атакуєте сонячну пташку.",
  "effect.alexsmobs.tigers_blessing.description": "Тигри поблизу користувача будуть нейтральними і захищатимуть його від ворожих супротивників. Ефект зникне, якщо атакувати тигра. Застосовується шляхом годування тигра куркою або свинячими відбивними.",

  "effect.apothic_attributes.flying.description": "Надає творчий політ.",
  "effect.apothic_attributes.grievious.description": "Зменшує отримане зцілення на 20% за кожен рівень.",
  "effect.apothic_attributes.knowledge.description": "Чотирикратно збільшує весь досвід, отриманий за вбивство сутностей. Ефект подвоюється з кожним рівнем.",
  "effect.apothic_attributes.vitality.description": "Збільшує отримане зцілення на 20% за кожен рівень.",

  "effect.archers_paradox.challenge_complete.description": "Показує успішне завершення серії з викликом стрілами.",
  "effect.archers_paradox.challenge_miss.description": "Показує невдачу у завершенні серії з викликом стрілами.",
  "effect.archers_paradox.challenge_streak.description": "Показує поточний час і рівень серії викликів.",
  "effect.archers_paradox.training_miss.description": "Показує перервану серію під час тренування з луком.",
  "effect.archers_paradox.training_streak.description": "Показує поточний час і рівень серії тренувань з луком.",

  "effect.ars_nouveau.mana_regen.description": "Швидше відновлює ману.",

  "effect.astralsorcery.bleed.description": "Швидко завдає шкоди з часом",
  "effect.astralsorcery.cheat_death.description": "Дозволяє сутності обдурити смерть. При активації підпалює мобів поблизу, надає стійкість до вогню та регенерацію при використанні",
  "effect.astralsorcery.drop_modifier.description": "Змінює дроп",

  "effect.atmospheric.gelled.description": "Спочатку гасить вогонь, трохи збільшує регенерацію життя та трохи зменшує вхідну вогняну шкоду. Якщо ефект отримано знову, поки він ще активний, користувач буде отруєний.",
  "effect.atmospheric.persistence.description": "Змушує сутності бігати швидше, чим нижчий їх рівень голоду.",
  "effect.atmospheric.relief.description": "Якщо отримана шкода більша або дорівнює рівню ефекту, користувач отримує зцілення; отримане зцілення дорівнює рівню ефекту.",
  "effect.atmospheric.spitting.description": "Поки цей ефект активний, користувач швидко випльовує насіння маракуї, яке може відкидати і завдавати шкоду мобам.",
  "effect.atmospheric.worsening.description": "Якщо отримана шкода більша або дорівнює рівню ефекту, користувач отримує шкоду; отримана шкода дорівнює рівню ефекту.",

  "effect.autumnity.extension.description": "Будь-які ефекти, отримані, поки користувач має ефект, отримують додаткові 30 секунд.",
  "effect.autumnity.foul_taste.description": "Наступний з'їдений харчовий продукт знімає ефект, але поповнює на 50% більше очок голоду, ніж зазвичай.",

  "effect.botania.allure.description": "У гравця, на якого діє ефект, вудка оновлюється вдвічі частіше, що фактично подвоює швидкість риболовлі.",
  "effect.botania.bloodthirst.description": "Дозволяє ворожим монстрам з'являтися в радіусі 64 блоків від користувача, незалежно від рівня освітлення та інших умов появи. Це включає можливість появи слимаків за межами слизових чанків.",
  "effect.botania.clear.description": "Очищає всі ефекти статусу.",
  "effect.botania.emptiness.description": "Запобігає природному спавну мобів у радіусі 128 блоків навколо ураженої сутності.",
  "effect.botania.feather_feet.description": "Скасовує шкоду від падіння. Цей ефект не запобігає шкоді від падіння з інших причин, таких як перлини Енду.",
  "effect.botania.soul_cross.description": "Відновлює 5% максимального здоров'я користувача щоразу, коли вбивається інша істота.",

  "effect.buzzier_bees.sunny.description": "Імітує сонячне світло. Фантоми не атакують мобів, які мають цей ефект, бджоли не сплять, якщо мають цей ефект, нежить, яка має цей ефект, згорає.",

  "effect.caverns_and_chasms.affliction.description": "Після закінчення ефекту завдає 3 магічної шкоди за кожен рівень ефекту.",
  "effect.caverns_and_chasms.rewind.description": "Після закінчення ефекту телепортує користувача в місце, де ефект був спочатку отриманий.",

  "effect.create_confectionery.rest.description": "Змушує фантомів зникати.",
  "effect.create_confectionery.stimulation.description": "Усуває утому таі повільність.",

  "effect.deeperdarker.sculk_affinity.description": "Маскує всі звуки, які видає гравець, щоб скалк-сенсори більше не могли їх вловлювати. Не маскує звуки, що видаються, наприклад, домашніми тваринами або впалими предметами!",

  "effect.dungeons_mobs.ensnared.description": "Впливає на сутності, які потрапили в пастку.",
  "effect.dungeons_mobs.warped.description": "Завдає смертельної магічної шкоди з часом.",

  "effect.dungeons_gear.shielding.description": "Надає імунітет до снарядів.",
  "effect.dungeons_gear.soul_protection.description": "Відроджує гравця після смерті.",
  "effect.dungeons_gear.stunned.description": "Оглушує об'єкт, викликаючи нудоту і сповільнюючи його рух. Вищі рівні збільшують шанс оглушення.",
  "effect.dungeons_gear.party_starter.description": "Близькі атаки змушують сутності вибухати.",
  "effect.dungeons_gear.dynamo.description": "Збільшує шкоду при наступній атаці, вищі рівні збільшують посилення шкоду.",
  "effect.dungeons_gear.life_steal.description": "Краде здоров'я у вбитих сутностей, вищі рівні збільшують кількість вкраденого здоров'я.",
  "effect.dungeons_gear.bow_charge.description": "Наступна атака на відстані автоматично буде повністю заряджена.",

  "effect.eidolon.anchored.description": "Запобігає телепортації ураженої істоти певними ефектами.",
  "effect.eidolon.chilled.description": "Вимикає пасивне відновлення здоров'я і робить так, що їжа не надає жодних очок голоду.",

  "effect.environmental.panic.description": "Збільшує швидкість, чим нижче здоров'я користувача.",
  "effect.environmental.serenity.description": "Риби коі зупиняють появу ворожих мобів в радіусі 32x32x8. Ефект спокою вказує, чи знаходиться гравець в цьому радіусі.",

  "effect.fantasy.glowing_vision.description": "Змушує єдинорогів в радіусі 500 блоків отримувати ефект світіння, що полегшує їх пошук.",

  "effect.farmersdelight.comfort.description": "Забезпечує природне відновлення, незалежно від того, наскільки ви голодні.",
  "effect.farmersdelight.nourishment.description": "Запобігає втраті голоду, крім випадків, коли для лікування поранень використовується насичення.",

  "effect.farmersrespite.caffeinated.description": "Збільшує швидкість ходьби та атаки цілі.",

  "effect.forbidden_arcanus.darkened.description": "Поєднання сліпоти та повільності.",
  "effect.forbidden_arcanus.fly.description": "Надає творчий політ.",
  "effect.forbidden_arcanus.spectral_vision.description": "Дозволяє бачити сутності крізь блоки: ворожі моби будуть світитися червоним, а пасивні — зеленим.",

  "effect.fruitful.sustaining.description": "Збільшує поживність усієї з'їденої їжі.",

  "effect.goodending.strong_immunity.description": "Сильний імунітет видаляє шкідливий ефект, а потім понижує до сучасного імунітету.",
  "effect.goodending.contemporary_immunity.description": "Сучасний імунітет видаляє шкідливий ефект, а потім понижує до розбитого імунітету.",
  "effect.goodending.shattered_immunity.description": "Розбитий імунітет видаляє шкідливий ефект, а потім розсіюється.",

  "effect.habitat.blast_endurance.description": "Зменшує шкоду, отриману від вибухів.",
  "effect.habitat.prickling,description": "Має шанс завдати нападнику шкоди, рівної рівню ефекта.",
  "effect.habitat.prolongation.description": "Збільшує тривалість всіх ефектів зілля на 20%.",

  "effect.immersiveengineering.concrete_feet.description": "Змушує ціль не рухатися і не стрибати. Ефект негайно закінчується, коли користувач більше не стоїть на бетоні.",
  "effect.immersiveengineering.conductive.description": "Уражені сутності отримують додаткову шкоду від електричного або «флюїсного» ураження, наприклад, від зброї Redstone Arsenal або електрифікованого колючого дроту.",
  "effect.immersiveengineering.flammable.description": "Збільшує вхідну шкоду від вогню.",
  "effect.immersiveengineering.flashed.description": "Екрани гравців, на яких діє цей ефект, будуть блимати білим, тимчасово засліплюючи їх.",
  "effect.immersiveengineering.slippery.description": "Уражені сутності будуть повільно ковзати вперед, коли знаходяться на землі, і кожна секунда має 1/300 шансу (приблизно 6,5% шансу щосекунди) впустити предмет, який вони тримають, або предмет у другій руці.",
  "effect.immersiveengineering.sticky.description": "Сильно уповільнює ціль і заважає стрибати.",
  "effect.immersiveengineering.stunned.description": "Ендермени, на яких діє цей ефект, не можуть телепортуватися.",

  "effect.infernalexp.infection.description": "Повільно отруює, завдаючи нелетальної шкоди з часом; може поширюватися на інших живих істот під час атаки.",
  "effect.infernalexp.luminous.description": "Змушує користувача випромінювати світло. Якщо застосувати до неживих мобів, вони спалахнуть.",

  "effect.mowziesmobs.frozen.description": "Заморожує та іммобілізує уражену істоту, одночасно завдаючи їй певної шкоди з часом.",
  "effect.mowziesmobs.geomancy.description": "Клацніть ПКМ по землі порожньою рукою, щоб створити валун. Утримуйте ПКМ, щоб створити більші валуни. Ударте валун, щоб запустити його як снаряд. Перебуваючи в повітрі, двічі натисніть і утримуйте кнопку «крастися», щоб почати рити тунель, дивлячись у напрямку, в якому ви хочете копати. Відпустіть кнопку «крастися», щоб припинити риття тунелю і вийти на поверхню.",
  "effect.mowziesmobs.poison_resist.description": "Надає імунітет до отрути.",
  "effect.mowziesmobs.suns_blessing.description": "Клацніть ПКМ порожньою рукою, щоб викликати сонячний удар, клацніть ПКМ з натиснутою клавішею Shift порожньою рукою, щоб вистрілити сонячним променем.",

  "effect.neapolitan.agility.description": "Дозволяє перелазити через будь-які блоки, як через драбини.",
  "effect.neapolitan.berserking.description": "Вбивство мобів підвищує ефект на 1 рівень кожного разу, кожен рівень додає сили та захисту.",
  "effect.neapolitan.harmony.description": "Змушує більшість ворожих мобів тікати від користувача.",
  "effect.neapolitan.slipping.description": "Змушує користувача рухатися по землі у випадкових напрямках.",
  "effect.neapolitan.sugar_rush.description": "Надає швидкість протягом перших трьох чвертей тривалости ефекту, а протягом останньої чверті — уповільнення.",
  "effect.neapolitan.vanilla_scent.description": "Блокує вхідні ефекти.",

  "effect.nether_extension.gentle.description": "Зменшує завдане відкидання.",
  "effect.nether_extension.infested.description": "Створює агресивних малюків Спорі навколо цілі.",
  "effect.nether_extension.rough.description": "Збільшує завдане відкидання.",

  "effect.quark.danger_sight.description": "Виділяє області, де можуть з'являтися ворожі моби.",
  "effect.quark.resilience.description":  "Надає 50% стійкості до відкидання.",

  "effect.rats.plague.description": "Вимикає природне відновлення здоров'я і перетворює серця на серця чуми. Чума може поширюватися на інші сутності через взаємодію",
  "effect.rats.synesthesia.description": "Надає необмежену ситість разом з повним рядом сердець поглинання і значно збільшує швидкість атаки. Коли ефект застосовується, поле зору буде збільшуватися і зменшуватися і буде забарвлене в помаранчевий колір. Коли ефект закінчується, відбувається протилежне.",

  "effect.savage_and_ravage.weigth.description": "Робить ціль дуже важкою.",

  "effect.seasonals.fall_flavor.description": "«Смакує як осінь!» Автоматично відновлює голод і насичення з часом.",
  "effect.seasonals.fall_flavour.description": "Надає користувачеві імунітет до шкоди від колючих рослин і шипів.",
  "effect.seasonals.puppeteering.description": "Дозволяє гравцеві підбирати та переміщати мобів з меншим здоров'ям.",
  "effect.seasonals.thorn_resistance.description": "Знижує шкоду від колючих рослин і шипів.",

  "effect.tetra.bleeding.description": "Завдає шкоди з часом.",
  "effect.tetra.earthbound.description": "Уражена істота сповільнюється, отримує менше відкидання і не може стрибати.",
  "effect.tetra.exhausted.description": "<Невідомо>",
  "effect.tetra.howling.description": "Надає 12,5% шансу відбити снаряд за кожен рівень ефекту, уповільнює швидкість руху на -5% і дає 2,5% шансу відправити снаряди назад туди, звідки вони прилетіли.",
  "effect.tetra.punctured.description": "Знижує броню на 10% за кожен рівень.",
  "effect.tetra.severed.description": "Знижує максимальне здоров'я і шкоду від атак.",
  "effect.tetra.small_health.description": "Менш потужна версія Припливу здоров'я.",
  "effect.tetra.small_strength.description": "Менш потужна версія Сили.",
  "effect.tetra.steeled.description": "<Невідомо>",
  "effect.tetra.stun.description": "Оглушує ціль, перешкоджаючи її руху, не даючи їй завдавати шкоди під час атаки та надаючи їй нескінченний час відновлення атаки.",

  "effect.twilightforest.frosted.description": "Ви знаходитесь там, де не повинні бути... поки що.",

  "effect.twist.afterburn.description": "Завдає шкоди користувачеві після закінчення дії ефекту.",
  "effect.twist.disintegration.description": "Завдає шкоди користувачеві під час спринту.",
  "effect.twist.hazy.description": "Недоступно.",
  "effect.twist.mold.description": "Змушує серце користувача битися швидше, коли він знаходиться на території Charger.",
  "effect.twist.outzimpled.description": "Забороняє користувачеві використовувати Zimples.",
  "effect.twist.parasite.description": "Недоступний.",

  "effect.untitledduckmod.intimidation.description": "Змушує розбійників боятися цілі.",

  "effect.upgrade_aquatic.insomnia.description": "Збільшує таймер безсоння на 1 день за кожен рівень ефекту, викликаючи появу фантомів. Якщо дати фантомам, вони перетворяться на спалахи, якщо дати спалахам, вони миттєво загинуть.",
  "effect.upgrade_aquatic.repellence.description": "Заражає отрутою мобів, які фізично торкаються користувача; вищі рівні збільшують рівень ефекту отрути.",
  "effect.upgrade_aquatic.restfulness.description": "Зменшує таймер безсоння на 1 день за кожен рівень ефекту, зменшуючи шанс появи фантомів. Якщо дати його спалахам, вони перетворяться на фантомів, а якщо дати фантомам, вони миттєво загинуть.",
  "effect.upgrade_aquatic.vibing.description": "Заражає регенерацією мобів, які фізично торкаються користувача; вищі рівні збільшують рівень ефекту регенерації.",

  "effect.windswept.thorns.description": "Завдає шкоди будь-якому мобу або гравцеві, який атакує ціль.",

  "effect.xreliquary.cure.description": "Ліки від чогось, це точно.",
  "effect.xreliquary.exhausted.description": "Ліки від чогось, це точно.",
  "effect.xreliquary.flight.description": "Надає творчий політ.",
  "effect.xreliquary.pacification.description": "Звільняє ціль від чужої агресії.",
  "effect.xreliquary.pacification": "Умиротворення",

  "effect.cofh_core.wrenched.description": "Змушує користувача постійно повертатися на 40° за годинниковою стрілкою кожну секунду за кожен рівень ефекту.",
  "effect.cofh_core.sundered.description": "Зменшує ефективність одягненої броні на 25% за кожен рівень.",
  "effect.cofh_core.slimed.description": "Надає імунітет до шкоди від падіння і змушує вас підстрибувати, як слиз.",
  "effect.cofh_core.shocked.description": "Зменшує швидкість атаки на 15% за кожен рівень.",
  "effect.cofh_core.lightning_resistance.description": "Надає імунітет до шкоди від блискавки.",
  "effect.cofh_core.panacea.description": "Надає імунітет до всіх негативних ефектів статусу.",
  "effect.cofh_core.magic_resistance.description": "Надає імунітет до всієї магічної шкоди.",
  "effect.cofh_core.love.description": "Змушує тварин поблизу перейти в режим кохання.",
  "effect.cofh_core.enderference.description": "Змушує ендерменів поблизу не мати можливості телепортуватися. Також вимикає телепортацію для гравців поблизу, які використовують ендер-перли або плоди хорусу.",
  "effect.cofh_core.clarity.description": "Збільшує кількість отриманого досвіду на 40% за кожен рівень.",
  "effect.cofh_core.explosion_resistance.description": "Надає імунітет до шкоди від вибухів.",
  "effect.cofh_core.chilled.description": "Зменшує швидкість руху на 30% і шкоду від атак на 1,5 серця за кожен рівень.",

  "effect.species.wither_resistance.description": "Надає імунітет до ефекту висушування.",
  "effect.species.birtd.description": "Оглушує уражених і не дозволяє їм рухатися, але не захищатися.",
  "effect.mynethersdelight.b_pungent.description": "Завдає шкоди від вогню, коли знаходиться поблизу джерела тепла. Замість цього лікує, якщо ви також маєте стійкість до вогню.",
  "effect.mynethersdelight.g_pungent.description": "Зцілює від джерел тепла в поєднанні з вогнестійкістю. Завдає шкоди без неї.",
  "effect.enigmaticlegacy.growing_hunger.description": "Згодом виснажує голод, але надає збільшену шкоду та крадіжку життя.",
  "effect.enigmaticlegacy.growing_bloodlust.description": "Згодом виснажує здоров'я, але надає збільшену шкоду та крадіжку життя. Застосовується тільки якщо носій прокляття з'їв заборонений плід.",
  "effect.mowziesmobs.sunblock.description": "Умвутана захищають свого вождя! Зупиніть їх, перш ніж вони вас переможуть!"
}