{
    "name": "Афікси",
    "icon": "minecraft:experience_bottle",
    "category": "apotheosis:adventure/affix_loot",
	"flag": "apotheosis:adventure",
	"sortnum": 0,
    "pages": [
        {
            "type": "patchouli:text",
            "text": "$(6)Афікси$() є рушійною силою афіксних предметів. Кожен афікс дуже схожий на зачарування, надаючи певний бонус предмету, до якого він прикріплений.$(p)У цій книзі не буде перелічено всі афікси, оскільки це вам належить з'ясувати самостійно, але вона допоможе їх пояснити."
        },
		{
			"type": "patchouli:text",
			"title": "Типи афіксів",
			"text": "Існує кілька різних типів афіксів, кожен з яких має певний набір функцій, які він може виконувати.$(p)Типи афіксів, що застосовуються до предмета, залежать від його $(l:apotheosis:adventure/affix_loot/rarities)рідкості$()."
		},
		{
			"type": "patchouli:text",
			"title": "Афікси характеристик",
			"text": "Найпоширенішим типом є афікси характеристик. Ці афікси надають простий бонус до певної характеристики і доступні для всіх рівнів рідкості.  Більш рідкісні предмети мають додаткові афікси характеристик."
		},
		{
			"type": "patchouli:text",
			"title": "Афікси ефектів",
			"text": "Афікси ефектів — найцікавіший тип афіксів. Вони можуть додавати до предметів різноманітні додаткові функції, від простих бонусів до потужних бойових ефектів.$(p)Їх можна знайти лише на предметах рідкісної рідкості та вище."
		},
		{
			"type": "patchouli:text",
			"title": "Касти",
			"text": "Каст — це особливий тип афікса, який просто служить контейнером для $(l:apotheosis:adventure/affix_loot/gems)самоцвітів$().$(p)Самоцвіти можуть давати великі бонуси, але їх буває важко знайти."
		},
		{
			"type": "patchouli:text",
			"title": "Афікси міцності",
			"text": "Афікс міцності робить предмет більш стійким до пошкоджень і присутній на всіх предметах, починаючи з рідкісної рідкості.$(p)Він застосовується після всіх інших видів стійкості до пошкоджень, що робить його мультиплікативним збільшенням до Незламності."
		}
	]
}