{
  "debugify.name": "Debugify",
  "debugify.basic": "Основні виправлення",
  "debugify.gameplay": "Виправлення ігроладу",
  "debugify.gameplay.warning": "УВАГА: Ця категорія містить виправлення, які можуть бути нечесною перевагою!",
  "debugify.gameplay.enable_in_multiplayer": "Увімкнути в мережевій грі",
  "debugify.fix.enabled": "Виправлено",
  "debugify.fix.disabled": "Не виправлено",
  "debugify.fix.unavailable": "Недоступно",
  "debugify.error.conflict": "Виправлення %s несумісне із модом '%s'",
  "debugify.error.os": "%s стосується лише %s",
  "debugify.error.mixin_error": "Помилка завантаження %s, перевірте журнал для отримання додаткової інформації.",
  "debugify.error.mixin_error.text": "Помилка",
  "debugify.os.windows": "Windows",
  "debugify.os.macos": "macOS",
  "debugify.os.linux": "Linux",
  "debugify.os.solaris": "Solaris",
  "debugify.misc": "Різне",
  "debugify.misc.default_disabled": "Усталено вимкнено",
  "debugify.misc.default_disabled.description": "Нові виправлення усталених помилок мають бути вимкнені, а не ввімкнені.",
  "debugify.env.client": "Клієнт",
  "debugify.env.client.desc": "Виправлення, які застосовуються тільки на клієнті.",
  "debugify.env.server": "Сервер",
  "debugify.env.server.desc": "Виправлення, які стосуються як клієнта, так і сервера, а також спільного коду між ними.",
  "debugify.no_yacl.title": "YetAnotherConfigLib не встановлено!",
  "debugify.no_yacl.description": "Щоб налаштувати Debugify за допомогою інтерфейсу, ви повинні встановити %s. Це бібліотека, яка використовується для надання цієї функції. В іншому разі ви можете налаштувати за допомогою файлу JSON, який зберігається в '%s'.",

  "debugify.mc_237493.header": "Вимкнення телеметрії Debugify",
  "debugify.mc_237493.line": "Ви обрали '%s' в опціях телеметрії, тому Debugify запобігатиме будь-якому з'єднанню з телеметричними службами з Mojang. Це можна зробити за допомогою Debugify для виправлення MC-237493.",
  "debugify.mc_237493.tooltip.off": "'%s' повністю вимикає будь-яке підключення до телеметричних сервісів Mojang. (Debugify MC-237493)",
  "debugify.mc_237493.tooltip.minimal": "'%s' включає лише ту інформацію, яку Mojang вважає необхідною.",
  "debugify.mc_237493.tooltip.all": "'%s' включає всю мінімальну та додаткову телеметрію.",

  "debugify.fix_explanation.mc-55347": "Очищає заголовки при відключенні.",
  "debugify.fix_explanation.mc-79545": "Затискає рівень досвіду до цілочисельної межі тільки під час відображення.",
  "debugify.fix_explanation.mc-93384": "Додає висоту ока до місця народження частинок.",
  "debugify.fix_explanation.mc-105068": "Робить звук розбиття щита локальним.",
  "debugify.fix_explanation.mc-108948": "Проблема в тому, що клієнт не виконує ті самі обчислення, що й сервер. Коли ніхто не керує човном, клієнт не виконує фізичні розрахунки на човні, що призводить до десинхронізації клієнта. Це виправлення просто вказує клієнту виконати деякі фізичні обчислення на човні.",
  "debugify.fix_explanation.mc-111516": "Модифікує математичне обчислення acos, щоб переконатися, що результат не перевищує 1.0",
  "debugify.fix_explanation.mc-112730": "Запобігає додаванню маяків та інших блок-сутностей до локального списку відображення блок-сутностей, якщо вони вже додані до глобального списку.",
  "debugify.fix_explanation.mc-122477": "Запобігає першим двом опитуванням клавіатури після ініціалізації вікна редагування, наприклад, вікна чату.",
  "debugify.fix_explanation.mc-123739": "Сортує записи книги рецептів за ідентифікатором.",
  "debugify.fix_explanation.mc-143474": "Копіює обраний слот предмета під час генерації нового локального гравця після респауну.",
  "debugify.fix_explanation.mc-159163": "Видаляє дані про позу з обробки пакетів даних сутності.",
  "debugify.fix_effect.mc-159163": "Це не дозволить клієнту синхронізувати дані про позу з сервером і використовуватиме лише клієнт для визначення пози.",
  "debugify.fix_explanation.mc-162253": "Зупиняє легке оновлення клієнта під вході до чанка.",
  "debugify.fix_explanation.mc-165381": "Скасовує знищення блоку, коли клієнт кидає предмет",
  "debugify.fix_explanation.mc_176559": "Не враховує міцність предмета під час порівняння зміни предмета при перевірці того, чи потрібно скидати розбиття блоку.",
  "debugify.fix_explanation.mc-197260": "Перевизначає рівень світла, що передається на відображення стійки для броні з максимальним значенням: блок під стійкою для броні, блок знизу стійки для броні, блок зверху стійки для броні та блок за стійкою для броні.",
  "debugify.fix_explanation.mc-237493": "Додає опцію у меню телеметрії для повного вимкнення телеметрії. Телеметрія вимикається шляхом перевизначення всіх вихідних телеметричних подій на порожні телеметричні події, які не надсилаються.",

  "debugify.fix_explanation.mc-2025": "Через неточності з плаваючою комою іноді хітбокс сутностей виявляється трохи меншим, ніж бажано. Якщо це станеться до того, як сутності будуть притиснуті одна до одної, вони перетнуться зі стіною. Потім, коли AABB буде перераховано за навантаженням, вони будуть визначені як такі, що знаходяться всередині стіни, куди їх потім буде виштовхнуто. Це виправлення просто додає тег 'AABB' до даних NBT сутностей з подвійною точністю розмірів хітбоксів, які потім завантажуються назад.",
  "debugify.fix_effect.mc-2025": "Це виправлення означає, що перше завантаження Debugify не виправить проблему, доки чанки не буде збережено та завантажено за допомогою Debugify.",
  "debugify.fix_explanation.mc-7569": "Додає новий рядок в кінець кожного системного повідомлення.",
  "debugify.fix_explanation.mc-30391": "Додає перевірку граничних випадків для частинок відтворення курки, пломеня та Візера, щоб не спавнити їх.",
  "debugify.fix_explanation.mc-69216": "Скидає рибальський гачок з цілі, що змінила режим гри на спостерігача.",
  "debugify.fix_explanation.mc-72151": "Вовки мають спеціальну функцію для зміни кількості шкоди, яку вони отримують, яка перетворює вхідну шкоду 0 на 0.5, це виправлення перевіряє, чи шкода дорівнює 0.5, і змінює її назад на 0.",
  "debugify.fix_explanation.mc-88371": "Встановлює позицію Y приземлення дракона на 65, якщо центр було знищено.",
  "debugify.fix_explanation.mc-89146": "Забезпечує суворий порядок збереження твердих сутностей відповідно до порядку оновлення, що дозволяє початкове оновлення твердих сутностей у правильному порядку.",
  "debugify.fix_explanation.mc-93018": "Починає розведення лише якщо вовк приручений.",
  "debugify.fix_explanation.mc-100991": "Сповіщає трекер шкоди про закинутий рибальський гачок, який завдає сутності з 0 шкоди, як сніжки.",
  "debugify.fix_explanation.mc-119417": "Не дає гравцеві заснути, коли він переходить у режим спостерігача.",
  "debugify.fix_explanation.mc-119754": "Повідомляє сутностям феєрверку, що гравці не літають надкрилами, якщо вони перебувають у режимі спостерігача",
  "debugify.fix_explanation.mc-121706": "Сутності із луковою атакою змушені дивитися на свою ціль.",
  "debugify.fix_explanation.mc-121903": "Додано NBT-тег 'LastExecuted' до командних блоків для збереження та завантаження їхньої останньої виконаної властивості.",
  "debugify.fix_explanation.mc-124117": "Надсилає гравцям пакети для оновлення всіх їхніх ефектів, досвіду та здібностей після телепорту між вимірами.",
  "debugify.fix_explanation.mc-132878": "Створює руйнівні частинки, коли пошкоджуються броньові стійки.",
  "debugify.fix_explanation.mc-135971": "Перевизначає поведінку клавіш CTRL+Q у гнізді для створення на повторне натискання клавіш CTRL+Q доти, доки у гнізді не залишиться жодного предмета.",
  "debugify.fix_explanation.mc-155509": "Перевіряє, чи живий скелезуб, перш ніж спробувати вколоти гравця.",
  "debugify.fix_explanation.mc-160095": "Якщо кактуси стикаються з головкою поршня, замість поршня розглядається блок, який рухається поршнем.",
  "debugify.fix_explanation.mc-179072": "Перевіряє, чи сутність, яку бачить кріпер, є ворогом перед тим, як спалахнути.",
  "debugify.fix_explanation.mc-183990": "Коли моб позначений галочкою, він перевіряє, чи його ціль мертва, і видаляє її, якщо це так. Це виправлення також стосується довгого списку істот, які мають групові атаки, не лише лусківниць.",
  "debugify.fix_explanation.mc-193343": "Не застосовує швидкість душі, якщо гравець є перебуває в режимі спостерігача.",
  "debugify.fix_explanation.mc-199467": "Модифікує вхідні дані у функції sin і cos, які обгортають вхідні дані від 0 до 2pi. Це запобігає виникненню цілочисельних переповнень. Хоча ця проблема, як повідомляється, є проблемою клієнта, першопричина лежить в обох середовищах, отже, вона знаходиться у файлі main.",
  "debugify.fix_explanation.mc-200418": "Знімає дитят селян з курей при виліковуванні.",
  "debugify.fix_explanation.mc-206922": "Предмети з віком менше 9 тактів не вилучаються з-під ударів блискавки.",
  "debugify.fix_explanation.mc-215530": "Скидає заморожений час, коли гравець змінює статус на спостерігача.",
  "debugify.fix_explanation.mc-224729": "Завжди зберігає проточанки, навіть якщо предикат збереження повертає false."
}