{
  "key.modernfix": "ModernFix",
  "key.modernfix.config": "Відкрити екран конфігурації",
  "modernfix.jei_load": "Завантаження JEI, це може зайняти деякий час",
  "modernfix.no_lazydfu": "LazyDFU не встановлено. Якщо Minecraft потрібно оновити дані гри зі старішої версії, може спостерігатися помітне відставання.",
  "modernfix.no_ferritecore": "FerriteCore не встановлено. Використання пам'яті буде дуже високим.",
  "modernfix.connectedness_dynresoruces": "Connectedness та опція динамічних ресурсів ModernFix несумісні. Видаліть Connectedness або вимкніть динамічні ресурси у конфігурації ModernFix.",
  "modernfix.perf_mod_warning": "Рекомендується встановити модифікації, але попередження можна вимкнути у конфігурації ModernFix.",
  "modernfix.config": "Конфігурація міксину ModernFix",
  "modernfix.config.done_restart": "Готово (потрібен перезапуск)",
  "modernfix.config.wiki": "Відкрити вікі",
  "modernfix.message.reload_config": "Виявлено зміну конфігураційного файлу модифікації. Щоб запобігти завантаженню файлів, які не було збережено, перезавантаження має бути ініційовано запуском /mfrc.",
  "modernfix.optiувімкнути.увімкнути": "увімкнути",
  "modernfix.option.вимкнено": "вимкнено",
  "modernfix.option.вимкнено": "вимкнено",
  "modernfix.option.увімкнено": "увімкнено",
  "modernfix.option.mod_override": " by mods [%s]",
  "modernfix.config.not_default": " (змінено)",
  "asynclocator.map.locating": "Мапа (Визначення місцезнаходження...)",
  "asynclocator.map.none": "Мапа (Поблизу не знайдено жодного об'єкта)",
  "modernfix.option.category.performance": "Продуктивність",
  "modernfix.option.category.performance.description": "Функції, які допомагають покращити продуктивність гри/запуску",
  "modernfix.option.category.bugfixes": "Виправлення помилок",
  "modernfix.option.category.bugfixes.description": "Виправлення основних вад для покращення стабільності гри",
  "modernfix.option.category.troubleshooting": "Виправлення неполадок/Утиліти",
  "modernfix.option.category.troubleshooting.description": "Функції, що допомагають діагностувати проблеми",
  "modernfix.option.category.expert_only": "Тільки для експертів",
  "modernfix.option.category.expert_only.description": "Не змінюйте, якщо не знаєте, що робите",
  "modernfix.option.name.mixin.perf.async_jei": "Фонове завантаження JEI",
  "modernfix.option.mixin.perf.async_jei": "Тільки для 1.16. **Ключова оптимізація. Виправляє перезавантаження JEI у фоновому потоці, повністю усуваючи тривалу затримку, яку він додає до завантаження світу.",
  "modernfix.option.mixin.perf.async_locator": "Лише у версії 1.16. Повернення патчів модифікації Async Locator для усунення зависань сервера, пов'язаних із `/locate`, генерацією таблиці луту тощо.",
  "modernfix.option.mixin.perf.biome_zoomer": "Тільки для 1.16. Незначна оптимізація для покращення продуктивності зумера біома з використанням логіки з 1.18.",
  "modernfix.option.mixin.perf.blast_search_trees": "Усі версії. Якщо встановлено REI або JEI, побудову ванільних дерев пошуку для творчого пошуку вимкнено, натомість пошук виконується за допомогою реалізацій пошуку цих модів. Це заощаджує кілька секунд під час завантаження світу, а також, можливо, трохи оперативної пам'яті (хоча я не вимірював).",
  "modernfix.option.mixin.perf.boost_worker_count": "Лише у версії 1.16. Видалено жорстке обмеження на кількість робочих потоків, подібно до того, як це було зроблено у Mojang у 1.18.",
  "modernfix.option.mixin.perf.cache_blockstate_cache_arrays": "У всіх версіях. Уникає створення нових копій масивів зчислень при кожній ініціалізації кешу стану блоків. Незначна оптимізація, але проста у виконанні.",
  "modernfix.option.mixin.perf.cache_model_materials": "Усі версії. Запам'ятовує колекцію `RenderMaterial` (текстури) та список залежностей, які повертає модель, замість того, щоб перераховувати їх при кожному запиті. Допомагає прискорити процес завантаження/запікання моделі.",
  "modernfix.option.mixin.perf.cache_strongholds": "Всі версії. Зберігає згенерований список позицій опорних пунктів разом зі світом, замість того, щоб перегенерувати його при кожному завантаженні світу. Заощаджує трохи часу на 1.16, і значно більше на 1.18 та 1.19.",
  "modernfix.option.mixin.perf.cache_upgraded_structures": "У всіх версіях. Багато модів постачаються із застарілими структурними файлами, що вимагає від гри оновлювати їх за допомогою DFU щоразу, коли вони завантажуються. Це може бути досить повільно. Цей патч додає логіку для збереження оновленої версії структури і повторного використання її при наступному завантаженні. Для випадку, коли мод змінює файл структури, але не назву, хеш оригінального файлу порівнюється з кешованою версією, і якщо вони не збігаються, структуру буде оновлено знову.",
  "modernfix.option.mixin.perf.compress_biome_container": "Лише у версії 1.16. Незначна оптимізація, запозичена з Hydrogen, яка намагається заощадити місце у контейнері біома, коли це можливо. Це автоматично вимикається, якщо встановлено конфліктуючі модифікації, такі як BetterEnd або Chocolate.",
  "modernfix.option.mixin.perf.datapack_reload_exceptions": "Усі версії. Зменшує кількість спаму у журналі і, можливо, дещо покращує швидкість завантаження, не друкуючи стекові траси для деяких типових винятків під час перезавантаження датапаку (наприклад, відсутні предмети у таблицях луту/рецептах). Повідомлення все одно виводиться.",
  "modernfix.option.mixin.perf.dedicated_reload_executor": "Усі версії. Переміщено перезавантаження пакунків ресурсів та даних до спеціального робочого пулу замість використання усталених потоків `Worker-Main`. Це дозволяє модифікаціям до Smooth Boot потенційно покращити продуктивність однокористувацької гри під час виконання, не сповільнюючи запуск через обмежену кількість потоків.",
  "modernfix.option.mixin.perf.deduplicate_location": "У всіх версіях, але усталено вимкнено через вплив на час завантаження. Дедуплікація просторів імен і шляхів розташування ресурсів. Це економить оперативну пам'ять, але також значно збільшує вартість створення нового `ResourceLocation`.",
  "modernfix.option.mixin.perf.dynamic_dfu": "Усі версії. Змінює ініціалізацію DFU так, щоб вона відбувалася під час першого оновлення. Звучить подібно до LazyDFU, але має відмінну реалізацію, оскільки уникає завантаження *будь-яких* класів/структур даних DFU, у той час як LazyDFU вимикає лише оптимізацію правил. По суті, цей параметр є безпечнішою версією DataFixerSlayer, оскільки він все одно завантажуватиме DFU, коли це буде потрібно.\n\nВи повинні продовжувати використовувати LazyDFU навіть з увімкненим цим параметром, оскільки інакше оптимізація правил DFU спричинить затримку.",
  "modernfix.option.mixin.perf.dynamic_resources": "Усі версії. Див. https://github.com/embeddedt/ModernFix/wiki/Dynamic-Resources-FAQ.",
  "modernfix.option.mixin.perf.dynamic_sounds": "Усі версії. Дозволяє грі вивантажувати звуки, замість того, щоб вони зберігалися після завантаження на невизначений час.",
  "modernfix.option.mixin.perf.dynamic_structure_manager": "У всіх версіях. Дозволяє грі вивантажувати структурні файли після завершення генерації, замість того, щоб залишати їх завантаженими назавжди.",
  "modernfix.option.mixin.perf.fast_registry_validation": "Усі версії. Forge без потреби шукає метод через рефлексію щоразу, коли перевіряється реєстр. Цей патч просто кешує повернуте значення, оскільки воно буде однаковим щоразу.",
  "modernfix.option.mixin.perf.faster_font_loading": "Усі версії. Оптимізує роботу рендерингу шрифтів для швидшого завантаження шрифтів, прискорюючи перезавантаження ресурсів.",
  "modernfix.option.mixin.perf.faster_item_rendering": "Усі версії. Уникає відображення боків предметів у графічному інтерфейсі. (Так, ваніль, здається, робить це.)\n\nЦе може потроїти FPS з модом на зразок REI/JEI, встановленим на слабких графічних процесорах, якщо видно достатньо об'єктів. Усталено вимкнено, оскільки він новий і мало протестований, але має бути безпечним. Найімовірнішою проблемою є повна невидимість об'єктів у графічному інтерфейсі або їх пласке відображення у світі.",
  "modernfix.option.mixin.perf.faster_texture_loading": "Усі версії до 1.19.4. Уникає читання текстур двічі (перший раз з використанням дуже повільного шляху коду), натомість виконує одне швидке завантаження (подібно до 1.19.3+).",
  "modernfix.option.mixin.perf.faster_texture_stitching": "Усі версії. Дозволяє грі використовувати швидшу систему зшивання текстур, написану SuperCoder79 для lwjgl3ify у версії 1.7.10, що може заощадити деякий час під час завантаження. Рідко, як повідомлялося, спричиняє дивні артефакти на блоках або у графічному інтерфейсі, це може бути вада натрію.",
  "modernfix.option.mixin.perf.jeresources_startup": "Лише у версії 1.16. Оптимізовано достатню кількість ресурсів, щоб не відтворювати селян багато разів для однієї і тієї ж професії, що економить час під час запуску JEI.",
  "modernfix.option.mixin.perf.kubejs": "Лише у 1.16. Оптимізації в KubeJS для уникнення непотрібного копіювання `ItemStack` і т.д., що зменшує час, необхідний для завантаження датапаків.",
  "modernfix.option.mixin.perf.model_optimizations": "Всі версії. Реалізовано оптимізації для прискорення процесу завантаження моделі.",
  "modernfix.option.mixin.perf.nbt_memory_usage": "Усі версії. Використовує ефективнішу карту підкріплення для складених NBT-тегів, яка дедублює імена ключів, а також використовує карту масивів для дуже малих складених тегів. Це зменшує накладні витрати на зберігання багатьох складених тегів у пам'яті.",
  "modernfix.option.mixin.perf.nuke_empty_chunk_sections": "Тільки у версії 1.16, натхненний воднем. Уникає зберігання у пам'яті ділянок, заповнених повітрям, натомість позначає їх як порожні.",
  "modernfix.option.mixin.perf.reduce_blockstate_cache_rebuilds": "Усі версії. **Ключова оптимізація. У нових версіях Minecraft (після 1.12) реалізовано систему кешування блоків, яка кешує часто використовувану інформацію про стан блоку, наприклад, чи є він цілісним, форму його зіткнення тощо. Відновлення цього кешу відбувається досить швидко у ванільній версії (це займає лише секунду або дві), але досить повільно з багатьма встановленими модами, оскільки у грі присутня набагато більша кількість блок-станів, і всі вони потребують відновлення кешу.\n\nЦю проблему загострює Forge, оскільки кеш перебудовується у багатьох точках, коли дані майже напевно не будуть використані до наступної перезбірки. Приклади включають в себе безпосередньо перед досягненням головного меню (на етапі \"Заморожування даних\"), а також декілька (!) разів під час завантаження світу.\n\nModernFix усуває це вузьке місце у продуктивності, натомість роблячи перезбірку кешу лінивою. Кожен блок-стан перебудовує свій кеш при першому зверненні до даних. У будь-який момент, коли ванільна версія або Forge намагатимуться перебудувати кеш для всіх блок-станів, буде перенаправлено на просто анулювання кешу для кожного блок-стану.\n\nЦе не повинно мати жодного впливу на TPS після завершення запуску.",
  "modernfix.option.mixin.perf.remove_biome_temperature_cache": "Усі версії. Видаляє кеш температури біома, як це робить Lithium у сучасних версіях.",
  "modernfix.option.mixin.perf.resourcepacks": "Усі версії. **Ключова оптимізація.** Запуск у сучасних версіях сильно ускладнений доступом до файлової системи. До пакунків ресурсів часто робиться багато запитів для отримання списку ресурсів або перевірки наявності певного ресурсу, і кожен з них призводить до дуже повільного виклику файлового API.\n\nModernFix повністю усуває більшість вузьких місць, просто кешуючи список усіх ресурсів, які існують у пакунках ресурсів з модифікаціями та у звичайних пакунках ресурсів. Кеш перебудовується при перезавантаженні ресурсів (окрім ванільних ресурсів, оскільки вони не повинні змінюватися під час гри).\n\nНевідомі проблеми сумісності з цим патчем, окрім OptiFine (його CTM ресурси завантажуються некоректно). Однак я не рекомендую використовувати OptiFine у будь-якому сценарії, оскільки він сам по собі додає кілька хвилин до часу запуску і взагалі не тестується ModernFix'ом.",
  "modernfix.option.mixin.perf.reuse_datapacks": "Тільки 1.16. Спроба пришвидшити перемикання між однокористувацькими світами, пропускаючи перезавантаження датапаку, коли це можливо. Може спричинити проблеми сумісності з деякими модами, але наразі усталено увімкнено.",
  "modernfix.option.mixin.perf.rewrite_registry": "Усі версії. **Агресивно замінює деякі внутрішні частини системи реєстру Forge на швидші версії, проте наразі спричиняє зависання під час завантаження деяких модпаків. Усталено вимкнено зі зрозумілих причин.",
  "modernfix.option.mixin.perf.skip_first_datapack_reload": "Тільки для 1.16 та 1.19. **Ключова оптимізація.**\n\nУ середині циклу розробки 1.16 Forge виправив гру, щоб вона перезавантажувала датапаки двічі під час завантаження існуючого світу, щоб виправити проблему зі зміщенням ідентифікатора біома. На жаль, перезавантаження пакетів даних часто займає до 30 секунд, і це дуже сильно впливає на час завантаження світу.\n\nModernFix вносить необхідні зміни, щоб уникнути цього перезавантаження, на основі незавершеного PR #8163.\n\nЦю зміну було вилучено Forge у 1.18, але потім аналогічний патч було додано *знову* у 1.19, щоб виправити те, що пакети даних модів не завантажуються під час створення нових однокористувацьких світів. На щастя, в 1.19 проблему локалізовано на екрані створення світу, а існуючі світи потребують лише одного перезавантаження. Однак, це все ще подвоює тривалість піку затримки при натисканні кнопки \"Створити новий світ\" у 1.19, і тому ModernFix знову вносить зміни, щоб не виконувати зайве перезавантаження.",
  "modernfix.option.mixin.perf.state_definition_construct": "Усі версії. Увімкнено лише якщо встановлено FerriteCore. Використовує переваги обробки блок-станів у FerriteCore для пришвидшення їх створення. Це може допомогти прискорити запуск модів, які додають багато блок-станів, наприклад, модів для меблів.",
  "modernfix.option.mixin.perf.sync_executor_sleep": "Усі версії. Дозволяє уникнути холостого обертання основного потоку, який споживає одне ядро процесора в очікуванні завершення завантаження модів.",
  "modernfix.option.mixin.perf.thread_priorities": "Усі версії. Налаштовує пріоритети робочих і серверних потоків так, щоб вони були нижчими за пріоритети клієнтського потоку. Це допомагає підвищити стабільність FPS на машинах з малою кількістю ядер процесора, за умови, що використовувана реалізація Java дотримується пріоритетів.",
  "modernfix.option.mixin.perf.use_integrated_resources": "Переважно для 1.16. Виправлено JEResources для використання даних інтегрованої таблиці луту сервера під час одиночної гри, замість безглуздого перезавантаження таблиць луту. Заощаджує ще кілька секунд під час запуску JEI.",
  "modernfix.option.mixin.bugfix.concurrency": "Виправлення у цій групі виправляють проблеми, пов'язані з паралелізмом у Minecraft та/або Forge. Більшість з них призводять до рідкісних, важко діагностованих збоїв під час завантаження.",
  "modernfix.option.mixin.bugfix.edge_chunk_not_saved": "Ця опція є портом модифікації Chunk Saving Fix від SuperCoder (оскільки я не знав, що вона вже була доступна для Forge на той час).",
  "modernfix.option.mixin.bugfix.mc218112": "Ця опція виправляє тупикову ситуацію, яка може виникнути, якщо під час обробки даних сутності буде згенеровано виключення. Ваніль неправильно розблоковує менеджер даних, коли це має відбуватися. Це відстежується як MC-218112 на трекері вад і було виправлено Mojang у версії 1.17.",
  "modernfix.option.mixin.bugfix.packet_leak": "**Експериментальний**, усталено не увімкнено. Спроба виправлення проблеми витоку пам'яті, яка виникає після досить тривалої гри у версіях 1.16.",
  "modernfix.option.mixin.bugfix.paper_chunk_patches": "1.18 та новіші версії. **Ключова оптимізація.** Перенесено патч з Paper, який виправляє проблеми 1.17 з завантаженням блоками, що вимагало величезних обсягів пам'яті та генерувало багато екземплярів `CompletableFuture`. 1.18+ тепер може завантажувати світи лише на 400 МБ пам'яті, як це було в 1.16.",
  "modernfix.option.mixin.bugfix.tf_cme_on_load": "Виправлено Twilight Forest для виконання не безпечного для потоків налаштування клієнта, використовуючи основний потік, як належить, а не робочий потік FML.",
  "modernfix.option.mixin.feature.branding": "Додано ModernFix до списку брендів на головному екрані, а також на екрані F3.",
  "modernfix.option.mixin.feature.direct_stack_trace": "Зазвичай вимкнено, можна увімкнути, щоб примусово скидати необроблену трасу стека до журналу під час аварійного завершення роботи. Іноді система звітів про аварії у ванілі не працює належним чином і видає абсолютно нерелевантний звіт про стан стека.",
  "modernfix.option.mixin.feature.measure_time": "Використовує пару ін'єкцій для вимірювання часу завантаження світу, часу перезавантаження пакетів даних, часу перезавантаження ресурсів, часу завантаження, а також додає необхідні хуки, щоб увімкнути невикористану логіку профілювальника ванілі для перезавантаження ресурсів, якщо так налаштовано.",
  "modernfix.option.mixin.feature.spam_thread_dump": "**Використовується лише з метою налагодження.** Спричиняє виведення дампа потоку до журналу кожні 60 секунд. Це може допомогти діагностувати незрозумілі зависання під час завантаження/ігрового процесу.",
  "modernfix.option.mixin.bugfix.chunk_deadlock": "Намагається запобігти блокуванням чанкової системи або надати додаткову налагоджувальну інформацію до журналу, коли вони виникають. Ці зависання зазвичай проявляються у вигляді зависання сервера на невизначений час (наприклад, об'єкти не рухаються), тоді як клієнт продовжує працювати належним чином.",
  "modernfix.option.mixin.bugfix.chunk_deadlock.valhesia": "Виправляє проблему у коді Valhesia Structures, яка спричиняє часті зависання під час worldgen/chunkloading.",
  "modernfix.option.mixin.bugfix.cofh_core_crash": "Виправлено проблему багатопоточності у CoFH Core, яка може спричиняти рідкісні падіння під час запуску.",
  "modernfix.option.mixin.bugfix.ctm_resourceutil_cme": "Виправлено багатопоточність у ConnectedTexturesMod, що могла призводити до рідкісних аварійних завершень під час запуску.",
  "modernfix.option.mixin.bugfix.ender_dragon_leak": "Виправлено витік пам'яті у ванілі, спричинений тим, що ендер-дракон зберігав посилання на попередній світ клієнта.",
  "modernfix.option.mixin.bugfix.entity_load_deadlock": "Виправлено багато проблем, коли EntityJoinWorldEvent/EntityJoinLevelEvent призводили до глухого кута у worldgen, дещо відтерміновуючи завантаження сутностей. Однак, це не повинно спричинити жодних помітних змін поведінки у грі.",
  "modernfix.option.mixin.bugfix.fix_config_crashes": "Виправлено помилку, через яку конфіги Forge іноді пошкоджувалися під час запуску гри.",
  "modernfix.option.mixin.bugfix.item_cache_flag": "Виправлення MC-258939",
  "modernfix.option.mixin.bugfix.preserve_early_window_pos": "Дозволяє ігровому вікну зберігати існуючий розмір, коли керування передається від раннього завантаження Forge до коду Minecraft. Виправлено телепортування вікна назад до центру екрана після перетягування тощо.",
  "modernfix.option.mixin.bugfix.refinedstorage.te_bug": "Виправлено ситуацію, коли при завантаженні блоків зовнішнього сховища Refined Storage іноді не відображався вміст шухляд тощо. Виправлено помилку PR #3435 у Refined Storage, яка була застосована лише у версії 1.18 та пізніших версіях.",
  "modernfix.option.mixin.bugfix.remove_block_chunkloading": "Виправлено зомбі-свинопасів, які вічно тримають 0, 0 блок у Forge завантаженим. Виправлено бекпорт виправлення Forge PR #8583.",
  "modernfix.option.mixin.bugfix.starlight_emptiness": "Виправлено аварійне завершення роботи Starlight через неініціалізацію порожніх мап. Бекпорт того ж виправлення у Starlight для 1.18.x.",
  "modernfix.option.mixin.core": "Основні патчі, необхідні для роботи ModernFix",
  "modernfix.option.mixin.devenv": "Патчі, що використовуються під час запуску у середовищі розробки, для покращення швидкости та/або тестування",
  "modernfix.option.mixin.safety": "Виправлення паралельності для запобігання збоїв під час запуску",
  "modernfix.option.mixin.feature.integrated_server_watchdog": "Додає ванільний сторожовий таймер до однокористувацьких світів, але лише роздруковує стекові траси, а не примусово завершує світ. Ця версія включає функціональність Fullstack Watchdog, але останній все одно потрібен для багатокористувацької гри.",
  "modernfix.option.mixin.feature.snapshot_easter_egg": "Додає функції 'пасхального яйця' (не впливає на ванільну візуалізацію або поведінку) під час запуску на версії зі знімком.",
  "modernfix.option.mixin.feature.spark_profile_launch": "Якщо увімкнено і встановлено сумісну версію Spark, вся послідовність запуску буде профілюватися аж до головного меню.",
  "modernfix.option.mixin.feature.warn_missing_perf_mods": "Показує попередження під час запуску, якщо відсутні інші моди продуктивності, які вважаються важливими та сумісними",
  "modernfix.option.mixin.launch.class_search_cache": "Замінює пошуковик ресурсів Forge (використовується для пошуку гри та коду мода) на значно швидшу версію, що пришвидшує запуск",
  "modernfix.option.mixin.perf.clear_fabric_mapping_tables": "Зменшує використання пам'яті, очищаючи структури даних відображення у Fabric Loader, які є надлишковими або рідко використовуються модами. Усталено вимкнено з міркувань сумісності.",
  "modernfix.option.mixin.perf.clear_mixin_classinfo": "Примусово завантажує всі міксини після завершення запуску, а потім очищає структури даних міксинів, щоб прибрати більшу частину пам'яті Mixin'а. Усталено вимкнено з міркувань сумісності.",
  "modernfix.option.mixin.perf.deduplicate_wall_shapes": "Змушує більшість стінових блоків використовувати один і той самий об'єкт форми замість того, щоб кожен з них мав власну копію. Може суттєво зменшити використання пам'яті, коли багато стінових блоків додається за допомогою модів.",
  "modernfix.option.mixin.perf.dynamic_resources.ae2": "Сумісність AE2 для динамічних ресурсів",
  "modernfix.option.mixin.perf.dynamic_resources.ctm": "Патч сумісності CTM для динамічних ресурсів",
  "modernfix.option.mixin.perf.dynamic_resources.rs": "Патч сумісності Refined Storage для динамічних ресурсів",
  "modernfix.option.mixin.perf.dynamic_resources.supermartijncore": "Патч сумісності SuperMartijn642CoreLib для динамічних ресурсів",
  "modernfix.option.mixin.perf.dynamic_resources.diagonalfences": "Виправлено сумісність діагональних огорож для динамічних ресурсів",
  "modernfix.option.mixin.perf.faster_advancements": "Переписано логіку перевірки просування, щоб вона була швидшою і не спричиняла StackOverflowError у великих пакетах. Перенесено налагодження просувань з Fabric.",
  "modernfix.option.mixin.perf.patchouli_deduplicate_books": "Виправлено ситуацію, коли у книгах Patchouli зберігається багато порожніх предметів з тегами NBT, що зменшує використання пам'яті.",
  "modernfix.option.mixin.perf.remove_spawn_chunks": "Повністю вилучено шматки спавну з гри. Вони більше не завантажуються взагалі, на відміну від Ksyxis.",
  "modernfix.option.mixin.perf.use_integrated_resources.jepb": "",
  "modernfix.option.mixin.perf.use_integrated_resources.jeresources": "",
  "modernfix.option.mixin.bugfix.blueprint_modif_memory_leak": "Виправлено витік ресурсів через ObjectModificationManager у Blueprint, що зменшує використання пам'яті. Незважаючи на те, що виправлення було запропоновано у PR #195, реліз ще не було зроблено.",
  "modernfix.option.mixin.bugfix.removed_dimensions": "Виправлено помилку, коли гра не завантажує світи, якщо вилучено модифікації виміру. Виправлення для Forge PR #8959.",
  "modernfix.option.mixin.perf.compact_bit_storage": "Виправлено марнотратство пам'яті, спричинене деякими застарілими серверами (наприклад, Hypixel), які надсилали порожні фрагменти так, ніби вони містять блоки. Значно зменшує використання пам'яті на цих серверах.",
  "modernfix.option.mixin.perf.deduplicate_climate_parameters": "Дедуплікація об'єктів кліматичних параметрів, що використовуються новою біосистемою, може заощадити ~2 МБ, але також дещо сповільнює перезавантаження пакетів даних.",
  "modernfix.option.mixin.perf.dynamic_entity_renderers": "Створює моделі сутностей під час їхнього першого бачення, а не під час запуску. Деякі модифікації не сумісні з цією опцією і спричиняють аварійне завершення роботи EntityRenderer.",
  "modernfix.option.mixin.perf.twilightforest.structure_spawn_fix": "Виправляє затримку, спричинену дуже неефективною перевіркою світлогенних структур у Twilight Forest",
  "modernfix.option.mixin.perf.fast_forge_dummies": "Прискорює зависання реєстру Forge під час запуску завдяки використанню швидшого шляху коду",
  "modernfix.option.mixin.perf.tag_id_caching": "Прискорює використання записів тегів завдяки кешуванню об'єкта локації замість того, щоб створювати його щоразу заново",
  "modernfix.option.mixin.feature.disable_unihex_font": "Видалення шрифту Unicode економить 10 МБ, але призводить до того, що спеціальні символи перестають відображатися",
  "modernfix.option.mixin.bugfix.world_leaks": "Зменшує використання пам'яті старих клієнтських світів, які не потрібні після зміни розмірів. Зазвичай це сміття, зібране у ванілі, але моди іноді зберігають посилання на нього.",
  "modernfix.option.mixin.perf.compact_mojang_registries": "(Fabric) Експериментальна опція, яка зменшує використання пам'яті реєстрів приблизно на 50%. Не є корисною у більшості модпаків, якщо вони не містять мільйони блоків та предметів.",
  "modernfix.option.mixin.perf.dynamic_block_codecs": "Уникає зберігання кодека для кожного блоку (стану), натомість генерує і кешує його на льоту, коли це необхідно. Зазвичай не варто вмикати, якщо у вас не мільйон блоків/предметів.",
  "modernfix.option.mixin.perf.faster_command_suggestions": "Зменшення затримки, коли під час введення команди є сотні тисяч пропозицій",
  "modernfix.option.mixin.perf.mojang_registry_size": "Виправлено проблему, через яку реєстрація блоків/предметів сповільнювалася пропорційно до кількості вже зареєстрованих блоків/предметів. Це покращує час запуску."
}